Tekla Open API Reference for Tekla Structures 2025
RebarLegFace.AdditonalOffset Property
 Gets or sets the user defined offset of the rebars from the rebar leg face.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double AdditonalOffset { get; set; }
Public Property AdditonalOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarLegFace Class
Tekla.Structures.Model Namespace